import { createRoot } from 'react-dom/client'
import App from './app'
import chalk from 'chalk';
import './locales/i18n';

const logo = chalk.rgb(246,55,90).bgRgb(53,53,53).underline(`
██████╗  █████╗ ██████╗ ███████╗ ██████╗██╗  ██╗ █████╗ ████████╗
██╔══██╗██╔══██╗██╔══██╗██╔════╝██╔════╝██║  ██║██╔══██╗╚══██╔══╝
██████╔╝███████║██████╔╝█████╗  ██║     ███████║███████║   ██║   
██╔══██╗██╔══██║██╔══██╗██╔══╝  ██║     ██╔══██║██╔══██║   ██║   
██████╔╝██║  ██║██████╔╝███████╗╚██████╗██║  ██║██║  ██║   ██║   
╚═════╝ ╚═╝  ╚═╝╚═════╝ ╚══════╝ ╚═════╝╚═╝  ╚═╝╚═╝  ╚═╝   ╚═╝   
`)
const context = chalk.black(`
===================================================================
안녕하세요. SILLO(병자) 입니다. 개발자 콘솔을 키신 이유가 뭘까요?
만약 실수라면 닫으시는걸 권장드리고 문제가 발생하셨다면
베이비챗 공식 디스코드 : https://discord.gg/babechat
사실 이건 이스터에그 입니다. 개발하다보면 이런것도 넣고싶어지더라구요
===================================================================
`)
console.log(logo + context);
createRoot(document.getElementById('main')!).render(
    <App />,
)